---
name: aws_fms_policy not being able to exclude tags containing same key name
about: `aws_fms_policy` is not able to exclude tags containing same key name due to its map properties where in the AWS console under the FMS policy, the user can add multiple tags with the same key name

---


### Community Note

* Please vote on this issue by adding a 👍 [reaction](https://blog.github.com/2016-03-10-add-reactions-to-pull-requests-issues-and-comments/) to the original issue to help the community and maintainers prioritize this request
* Please do not leave "+1" or other comments that do not add relevant new information or questions, they generate extra noise for issue followers and do not help prioritize the request
* If you are interested in working on this issue or have submitted a pull request, please leave a comment


### Terraform CLI and Terraform AWS Provider Version

This is not a terraform issue but I added the details below.

```
Terraform v1.1.7
on darwin_amd64

Your version of Terraform is out of date! The latest version
is 1.2.5. You can update by downloading from https://www.terraform.io/downloads.html
```

### Affected Resource(s)

* aws_fms_policy

### Terraform Configuration Files


Please include all Terraform configurations required to reproduce the bug. Bug reports without a functional reproduction may be closed without investigation.

```hcl
resource "aws_fms_policy" "default" {
  name                               = "test-policy"
  exclude_resource_tags              = false
  remediation_enabled                = true
  delete_unused_fm_managed_resources = true
  resource_type_list                 = ["AWS::ElasticLoadBalancingV2::LoadBalancer"]
  resource_tags                      = {
    waf = "x1",
    waf = "x2",
    waf = "x3"
  }


  security_service_policy_data {
    type = "WAFV2"

    managed_service_data = jsonencode({
      type                                    = "WAFV2"
      sampledRequestsEnabledForDefaultActions = null
      preProcessRuleGroups                    = [{
    ruleGroupArn  = null
    ruleGroupType = "ManagedRuleGroup"
    overrideAction = {
      type = "NONE"
    }
    managedRuleGroupIdentifier = {
      vendorName           = "AWS"
      managedRuleGroupName = "AWSManagedRulesAmazonIpReputationList"
      version              = null
      versionEnabled       = null
    }
    sampledRequestsEnabled = null
    excludeRules           = null

  }]
      postProcessRuleGroups                   = []
      defaultAction = {
        type = "Allow"
      }
      overrideCustomerWebACLAssociation = false
      loggingConfiguration = {
        logDestinationConfigs = null
        loggingFilterConfigs  = null
        redactedFields        = []
      }
    })
  }



  tags = {
    Name = "test-policy"
  }

  provider = aws.infosec
}
```

### Expected Behavior

I was expecting to have listed all `resource_tags` defined

### Actual Behavior

It only lists the last tag defined..

### Steps to Reproduce

just replace the aws provider with the one where firewall-manager service is enabled and then run `terraform plan` to see the resource tags shown

### Important Factoids

Terraform plan:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_fms_policy.default will be created
  + resource "aws_fms_policy" "default" {
      + arn                                = (known after apply)
      + delete_all_policy_resources        = true
      + delete_unused_fm_managed_resources = true
      + exclude_resource_tags              = false
      + id                                 = (known after apply)
      + name                               = "test-policy"
      + policy_update_token                = (known after apply)
      + remediation_enabled                = true
      + resource_tags                      = {
          + "waf" = "x3"
        }
      + resource_type                      = (known after apply)
      + resource_type_list                 = [
          + "AWS::ElasticLoadBalancingV2::LoadBalancer",
        ]
      + tags                               = {
          + "Name" = "test-policy"
        }
      + tags_all                           = {
          + "Name" = "test-policy"
        }

      + security_service_policy_data {
          + managed_service_data = jsonencode(
                {
                  + defaultAction                           = {
                      + type = "Allow"
                    }
                  + loggingConfiguration                    = {
                      + logDestinationConfigs = null
                      + loggingFilterConfigs  = null
                      + redactedFields        = []
                    }
                  + overrideCustomerWebACLAssociation       = false
                  + postProcessRuleGroups                   = []
                  + preProcessRuleGroups                    = [
                      + {
                          + excludeRules               = null
                          + managedRuleGroupIdentifier = {
                              + managedRuleGroupName = "AWSManagedRulesAmazonIpReputationList"
                              + vendorName           = "AWS"
                              + version              = null
                              + versionEnabled       = null
                            }
                          + overrideAction             = {
                              + type = "NONE"
                            }
                          + ruleGroupArn               = null
                          + ruleGroupType              = "ManagedRuleGroup"
                          + sampledRequestsEnabled     = null
                        },
                    ]
                  + sampledRequestsEnabledForDefaultActions = null
                  + type                                    = "WAFV2"
                }
            )
          + type                 = "WAFV2"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

### References

<!---
Information about referencing Github Issues: https://help.github.com/articles/basic-writing-and-formatting-syntax/#referencing-issues-and-pull-requests

Are there any other GitHub issues (open or closed) or pull requests that should be linked here? Vendor documentation? For example:
--->

* #0000